performance-api/POS/Comprobantes/Comprobante.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Comprobante">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Comprobante media">
        <stringProp name="ThreadGroup.num_threads">${hilos}</stringProp>
        <intProp name="ThreadGroup.ramp_time">60</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.domain">staging.duxsoftware.com.ar</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/sesion/facturacion/pos/factura</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;id_dux&quot;: 3258,&#xd;
  &quot;id_personal&quot;: 3365732,&#xd;
  &quot;id_empresa&quot;: 3455,&#xd;
  &quot;id_sucursal&quot;: 1,&#xd;
  &quot;id_deposito&quot;: 6671,&#xd;
  &quot;id_cliente&quot;: 3213439,&#xd;
  &quot;fecha_comprobante&quot;: &quot;&quot;,&#xd;
  &quot;nro_pto_vta&quot;: &quot;339&quot;,&#xd;
  &quot;tipo_entrega&quot;: &quot;ENTREGA_INMEDIATA&quot;,&#xd;
  &quot;tipo_comp&quot;: &quot;COMPROBANTE_VENTA&quot;,&#xd;
  &quot;productos&quot;: [&#xd;
        {&#xd;
            &quot;cod_item&quot;: &quot;339&quot;,&#xd;
            &quot;item&quot;: &quot;NOTEBOOK&quot;,&#xd;
            &quot;id_det_item&quot;: null,&#xd;
            &quot;ctd&quot;: 1,&#xd;
            &quot;porc_desc&quot;: 0,&#xd;
            &quot;porc_iva&quot;: 21,&#xd;
            &quot;impuesto_interno&quot;: 0,&#xd;
            &quot;precio_uni&quot;: 242,&#xd;
            &quot;observaciones&quot;: &quot;&quot;&#xd;
        }&#xd;
    ],&#xd;
    &quot;cobro&quot;: {&#xd;
        &quot;tipo_comp&quot;: &quot;COMPROBANTE_VENTA&quot;,&#xd;
        &quot;total&quot;: 242,&#xd;
        &quot;id_caja&quot;: 7618,&#xd;
        &quot;id_moneda&quot;: 1,&#xd;
        &quot;cotiza_moneda&quot;: 0,&#xd;
        &quot;detalle&quot;: [&#xd;
            {&#xd;
                &quot;tipo_valor&quot;: &quot;EFECTIVO&quot;,&#xd;
                &quot;monto&quot;: 242,&#xd;
                &quot;referencia&quot;: &quot;&quot;,&#xd;
                &quot;id_cuenta&quot;: null,&#xd;
                &quot;id_plan_cuenta&quot;: null,&#xd;
                &quot;id_tarjeta&quot;: null,&#xd;
                &quot;id_plan_tarjeta&quot;: null,&#xd;
                &quot;id_terminal&quot;: null,&#xd;
                &quot;nro_lote&quot;: null,&#xd;
                &quot;nro_cupon&quot;: null&#xd;
            }&#xd;
        ]&#xd;
    }&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">authorization</stringProp>
                <stringProp name="Header.value">dSn%[46*Yp@AEVxiXOFRqv*D$ciKD#L#3#21QNO$P#k5ARlJ.@jA8L4KDIIygINr</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49587">201</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="TestPlan.comments">Error mientras mas alto mas rompio &gt;&gt;&gt;</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Graph">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="Gestor de Cookies HTTP">
          <collectionProp name="CookieManager.cookies">
            <elementProp name="JSESSIONID" elementType="Cookie" testname="JSESSIONID">
              <stringProp name="Cookie.value">${cookies}</stringProp>
              <stringProp name="Cookie.domain">staging.duxsoftware.com.ar</stringProp>
              <stringProp name="Cookie.path">/</stringProp>
              <boolProp name="Cookie.secure">true</boolProp>
              <longProp name="Cookie.expires">0</longProp>
              <boolProp name="Cookie.path_specified">true</boolProp>
              <boolProp name="Cookie.domain_specified">true</boolProp>
            </elementProp>
          </collectionProp>
          <boolProp name="CookieManager.clearEachIteration">false</boolProp>
          <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
        </CookieManager>
        <hashTree/>
      </hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables definidas por el Usuario">
        <collectionProp name="Arguments.arguments">
          <elementProp name="cookies" elementType="Argument">
            <stringProp name="Argument.name">cookies</stringProp>
            <stringProp name="Argument.value">${__P(cookies)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="hilos" elementType="Argument">
            <stringProp name="Argument.name">hilos</stringProp>
            <stringProp name="Argument.value">${__P(hilos)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>